package com.javarush.test.level03.lesson12.home01;

/**
 * JavaRush.ru
 * Level 03, Lesson 12, Home 01
 * <br>
 * Вывести на экран надпись "Жить хорошо, а хорошо жить еще лучше".
 * <br>
 * Date: 09.05.13
 * @author Sergey Kandalintsev
 */
public class Solution
{
    public static void main( String[] args )
    {
        System.out.println( "Жить хорошо, а хорошо жить еще лучше" );
    }
}
