package com.javarush.test.level04.lesson16.home01;

/**
 *JavaRush.ru
 *Level 04, Lesson 16, Home 01
 *
 * Вывести на экран сто раз надпись "Я никогда не буду работать за копейки. Амиго."
 *
 * Date: 20.01.13
 * @author Sergey Kandalintsev
 */
public class Solution
{
    public static void main(String[] args)
    {
        for (int i = 0; i < 100; i++ )
            System.out.println("Я никогда не буду работать за копейки. Амиго");
    }
}
