package com.javarush.test.level03.lesson12.home02;

/**
 * JavaRush.ru
 * Level 03, Lesson 12, Home 02
 * <p/>
 * Вывести на экран десять раз надпись "Я не хочу изучать Java, я хочу большую зарплату".
 * <p/>
 * Date: 09.05.13
 * @author Sergey Kandalintsev
 */
public class Solution
{
    public static void main( String[] args )
    {
        for ( int i = 0; i < 10; i++ )
        {
            System.out.println( "Я не хочу изучать Java, я хочу большую зарплату" );
        }
    }
}
